## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_manifest.gateway_resource must be replaced
-/+ resource "kubernetes_manifest" "gateway_resource" {
!       manifest = {
!           metadata   = {
                name      = "argocd-gateway"
!               namespace = "kube-argocd" -> "argocd" # forces replacement
            }
            # (3 unchanged elements hidden)
        }
!       object   = {
!           metadata   = {
!               annotations                = null -> (known after apply)
!               clusterName                = null -> (known after apply)
!               creationTimestamp          = null -> (known after apply)
!               deletionGracePeriodSeconds = null -> (known after apply)
!               deletionTimestamp          = null -> (known after apply)
!               finalizers                 = null -> (known after apply)
!               generateName               = null -> (known after apply)
!               generation                 = null -> (known after apply)
!               labels                     = null -> (known after apply)
!               managedFields              = null -> (known after apply)
                name                       = "argocd-gateway"
!               namespace                  = "kube-argocd" -> "argocd"
!               ownerReferences            = null -> (known after apply)
!               resourceVersion            = null -> (known after apply)
!               selfLink                   = null -> (known after apply)
!               uid                        = null -> (known after apply)
            }
!           spec       = {
!               servers  = [
!                   {
!                       bind            = null -> (known after apply)
!                       defaultEndpoint = null -> (known after apply)
!                       name            = null -> (known after apply)
!                       port            = {
                            name       = "https"
!                           targetPort = null -> (known after apply)
                            # (2 unchanged elements hidden)
                        }
!                       tls             = {
!                           caCertificates        = null -> (known after apply)
!                           cipherSuites          = null -> (known after apply)
!                           httpsRedirect         = null -> (known after apply)
!                           maxProtocolVersion    = null -> (known after apply)
!                           minProtocolVersion    = null -> (known after apply)
!                           privateKey            = null -> (known after apply)
!                           serverCertificate     = null -> (known after apply)
!                           subjectAltNames       = null -> (known after apply)
!                           verifyCertificateHash = null -> (known after apply)
!                           verifyCertificateSpki = null -> (known after apply)
                            # (2 unchanged elements hidden)
                        }
                        # (1 unchanged element hidden)
                    },
!                   {
!                       bind            = null -> (known after apply)
!                       defaultEndpoint = null -> (known after apply)
!                       name            = null -> (known after apply)
!                       port            = {
                            name       = "http"
!                           targetPort = null -> (known after apply)
                            # (2 unchanged elements hidden)
                        }
!                       tls             = {
!                           caCertificates        = null -> (known after apply)
!                           cipherSuites          = null -> (known after apply)
!                           credentialName        = null -> (known after apply)
!                           maxProtocolVersion    = null -> (known after apply)
!                           minProtocolVersion    = null -> (known after apply)
!                           mode                  = null -> (known after apply)
!                           privateKey            = null -> (known after apply)
!                           serverCertificate     = null -> (known after apply)
!                           subjectAltNames       = null -> (known after apply)
!                           verifyCertificateHash = null -> (known after apply)
!                           verifyCertificateSpki = null -> (known after apply)
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_service_account.redis_service_account will be updated in-place
!   resource "kubernetes_service_account" "redis_service_account" {
        id                              = "kube-argocd/argocd-redis"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "argocd-redis-token-kbb5k" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
